import streamlit as st
st.set_page_config(layout="wide")
st.title("摄影器材杂谈")

st.write("我拍摄的照片发布在https://500px.com.cn/WilliamKing ，视频发布在https://space.bilibili.com/478036060? 和https://www.acfun.cn/u/76077623 （包含其它类型的视频）")
st.subheader("1.手机", divider=True)
st.write("我换手机是在2022年，相机的溢价还比较严重，就选择OPPO FInd X5 Pro作为主力摄影设备。骁龙888以上的手机计算摄影性能大幅提升。相应摄像头使用1/1.7英寸以上的传感器的话拍照解析度尚可，宽容度比较高。")
st.write("然而，在用于视频拍摄时，由于能进行多帧合成的数量有限，拍摄画质受传感器制约比较严重，即使使用1英寸传感器，拍摄细节较多的场景时实际解析度也难以达到1080p。虽然一些测试者表示旗舰手机的防抖可用于视频拍摄，但我实测还是需要稳定器。入门级的就行。")
st.subheader("2.运动相机", divider=True)
st.write("我入手过两台运动相机。其中Insta360 Go2传感器较小，画质差，原本考虑用于穿越机，但后面没有正式入坑穿越机，主要进行了运动摄影和延时摄影。")
st.write("为了拍摄画质更高的视频，考虑到当时相机仍然有明显溢价，就入手了Insta360 One R一英寸版本，在拍摄分辨率设为5.3k时，总体画质能达到1080p水平，运动幅度较小的视频清晰度表现比较好，运动幅度大的视频清晰度明显下降。")
st.subheader("3.微单", divider=True)
st.write("随着我在DCC领域的探索，渲染了不少4k视频，也希望实拍视频能达到4k画质。正好赶上不少m43画幅微单价格跳水，就入手了松下GH5和松下14-45mm镜头，加上稳定器大约相当于旗舰手机的优惠价格，也差不多是我能接受的非商用摄影的最高器材价格。拍摄的视频实际解析度接近4k，并且能拍摄HDR视频。在照片拍摄中相比手机也有连拍速度快和色彩还原度高的优势。")
st.write("为了进行HDR视频后期和观看其他人制作的HDR视频，我入手了一个HDR屏幕，考虑方便跟笔记本电脑组双屏和价格等因素，选了使用笔记本电脑屏幕面板改装的便携式显示器。最大亮度1220尼特并且也是全屏最大亮度，有2304分区。虽然ips面板对比度差一些，但实际使用效果还可以。")
st.subheader("4.后续规划", divider=True)
st.write("入手微单后已经满足大部分场景的拍摄要求了。虽然换连续对焦能力和宽容度更高的设备能带来提升，但如果要更换摄影器材，我还是希望使用满足前面的要求并且能拍摄12bit视频的设备。至于更换的时机，一方面设备价格要合适，另一方面也需要配套的支持12bit硬件编解码的GPU和最大亮度4000nit以上的屏幕普及，不然12bit优势不大。")

